Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxLmu_reg.h
/** \brief 1DC, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN8_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81001DCu)
/** Alias (User Manual Name) for LMU0_RGNACCEN8_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN8_RB.
*/
#define LMU0_RGNACCENRB8 (LMU0_RGNACCEN8_RB)

/** \brief 1E8, LMU Region Read Access Enable Register A */
#define LMU0_RGNACCEN9_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81001E8u)
/** Alias (User Manual Name) for LMU0_RGNACCEN9_RA.
* To use register names with standard convension, please use LMU0_RGNACCEN9_RA.
*/
#define LMU0_RGNACCENRA9 (LMU0_RGNACCEN9_RA)

/** \brief 1EC, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN9_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81001ECu)
/** Alias (User Manual Name) for LMU0_RGNACCEN9_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN9_RB.
*/
#define LMU0_RGNACCENRB9 (LMU0_RGNACCEN9_RB)

/** \brief 1F8, LMU Region Read Access Enable Register A */
#define LMU0_RGNACCEN10_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81001F8u)
/** Alias (User Manual Name) for LMU0_RGNACCEN10_RA.
* To use register names with standard convension, please use LMU0_RGNACCEN10_RA.
*/
#define LMU0_RGNACCENRA10 (LMU0_RGNACCEN10_RA)

/** \brief 1FC, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN10_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81001FCu)
/** Alias (User Manual Name) for LMU0_RGNACCEN10_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN10_RB.
*/
#define LMU0_RGNACCENRB10 (LMU0_RGNACCEN10_RB)

/** \brief 208, LMU Region Read Access Enable Register A */
#define LMU0_RGNACCEN11_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8100208u)
/** Alias (User Manual Name) for LMU0_RGNACCEN11_RA.
* To use register names with standard convension, please use LMU0_RGNACCEN11_RA.
*/
#define LMU0_RGNACCENRA11 (LMU0_RGNACCEN11_RA)

/** \brief 20C, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN11_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF810020Cu)
/** Alias (User Manual Name) for LMU0_RGNACCEN11_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN11_RB.
*/
#define LMU0_RGNACCENRB11 (LMU0_RGNACCEN11_RB)

/** \brief 218, LMU Region Read Access Enable Register A */
#define LMU0_RGNACCEN12_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8100218u)
/** Alias (User Manual Name) for LMU0_RGNACCEN12_RA.
* To use register names with standard convension, please use LMU0_RGNACCEN12_RA.
*/
#define LMU0_RGNACCENRA12 (LMU0_RGNACCEN12_RA)

/** \brief 21C, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN12_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF810021Cu)
/** Alias (User Manual Name) for LMU0_RGNACCEN12_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN12_RB.
*/
#define LMU0_RGNACCENRB12 (LMU0_RGNACCEN12_RB)

/** \brief 228, LMU Region Read Access Enable Register A */
#define LMU0_RGNACCEN13_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8100228u)
/** Alias (User Manual Name) for LMU0_RGNACCEN13_RA.
* To use register names with standard convension, please use LMU0_RGNACCEN13_RA.
*/
#define LMU0_RGNACCENRA13 (LMU0_RGNACCEN13_RA)

/** \brief 22C, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN13_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF810022Cu)
/** Alias (User Manual Name) for LMU0_RGNACCEN13_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN13_RB.
*/
#define LMU0_RGNACCENRB13 (LMU0_RGNACCEN13_RB)

/** \brief 238, LMU Region Read Access Enable Register A */
#define LMU0_RGNACCEN14_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8100238u)
/** Alias (User Manual Name) for LMU0_RGNACCEN14_RA.
* To use register names with standard convension, please use LMU0_RGNACCEN14_RA.
*/
#define LMU0_RGNACCENRA14 (LMU0_RGNACCEN14_RA)

/** \brief 23C, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN14_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF810023Cu)
/** Alias (User Manual Name) for LMU0_RGNACCEN14_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN14_RB.
*/
#define LMU0_RGNACCENRB14 (LMU0_RGNACCEN14_RB)

/** \brief 248, LMU Region Read Access Enable Register A */
#define LMU0_RGNACCEN15_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8100248u)
/** Alias (User Manual Name) for LMU0_RGNACCEN15_RA.
* To use register names with standard convension, please use LMU0_RGNACCEN15_RA.
*/
#define LMU0_RGNACCENRA15 (LMU0_RGNACCEN15_RA)

/** \brief 24C, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN15_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF810024Cu)
/** Alias (User Manual Name) for LMU0_RGNACCEN15_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN15_RB.
*/
#define LMU0_RGNACCENRB15 (LMU0_RGNACCEN15_RB)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Lmu_Registers_Cfg_Lmu1
 * \{  */
/** \brief 0, LMU Clock Control Register */
#define LMU1_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_CLC*)0xF8110000u)

/** \brief 8, LMU Module ID Register */
#define LMU1_MODID /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_MODID*)0xF8110008u)

/** \brief 10, LMU Access Enable Register 0 */
#define LMU1_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_ACCEN0*)0xF8110010u)

/** \brief 14, LMU Access Enable Register 1 */
#define LMU1_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_ACCEN1*)0xF8110014u)

/** \brief 20, LMU Memory Control Register */
#define LMU1_MEMCON /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_MEMCON*)0xF8110020u)

/** \brief 24, LMU Safety Control Register */
#define LMU1_SCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_SCTRL*)0xF8110024u)

/** \brief 50, LMU Region Lower Address Register */
#define LMU1_RGN0_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8110050u)
/** Alias (User Manual Name) for LMU1_RGN0_LA.
* To use register names with standard convension, please use LMU1_RGN0_LA.
*/
#define LMU1_RGNLA0 (LMU1_RGN0_LA)

/** \brief 54, LMU Region Upper Address Register */
#define LMU1_RGN0_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8110054u)
/** Alias (User Manual Name) for LMU1_RGN0_UA.
* To use register names with standard convension, please use LMU1_RGN0_UA.
*/
#define LMU1_RGNUA0 (LMU1_RGN0_UA)

/** \brief 58, LMU Region Write Access Enable Register A */
#define LMU1_RGN0_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8110058u)
/** Alias (User Manual Name) for LMU1_RGN0_ACCENA.
* To use register names with standard convension, please use LMU1_RGN0_ACCENA.
*/
#define LMU1_RGNACCENWA0 (LMU1_RGN0_ACCENA)

/** \brief 5C, LMU Region Write Access Enable Register B */
#define LMU1_RGN0_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF811005Cu)
/** Alias (User Manual Name) for LMU1_RGN0_ACCENB.
* To use register names with standard convension, please use LMU1_RGN0_ACCENB.
*/
#define LMU1_RGNACCENWB0 (LMU1_RGN0_ACCENB)

/** \brief 60, LMU Region Lower Address Register */
#define LMU1_RGN1_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8110060u)
/** Alias (User Manual Name) for LMU1_RGN1_LA.
* To use register names with standard convension, please use LMU1_RGN1_LA.
*/
#define LMU1_RGNLA1 (LMU1_RGN1_LA)

/** \brief 64, LMU Region Upper Address Register */
#define LMU1_RGN1_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8110064u)
/** Alias (User Manual Name) for LMU1_RGN1_UA.
* To use register names with standard convension, please use LMU1_RGN1_UA.
*/
#define LMU1_RGNUA1 (LMU1_RGN1_UA)

/** \brief 68, LMU Region Write Access Enable Register A */
#define LMU1_RGN1_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8110068u)
/** Alias (User Manual Name) for LMU1_RGN1_ACCENA.
* To use register names with standard convension, please use LMU1_RGN1_ACCENA.
*/
#define LMU1_RGNACCENWA1 (LMU1_RGN1_ACCENA)

/** \brief 6C, LMU Region Write Access Enable Register B */
#define LMU1_RGN1_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF811006Cu)
/** Alias (User Manual Name) for LMU1_RGN1_ACCENB.
* To use register names with standard convension, please use LMU1_RGN1_ACCENB.
*/
#define LMU1_RGNACCENWB1 (LMU1_RGN1_ACCENB)

