Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxLmu_reg.h
/** \brief 1DC, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN8_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81101DCu)
/** Alias (User Manual Name) for LMU1_RGNACCEN8_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN8_RB.
*/
#define LMU1_RGNACCENRB8 (LMU1_RGNACCEN8_RB)

/** \brief 1E8, LMU Region Read Access Enable Register A */
#define LMU1_RGNACCEN9_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81101E8u)
/** Alias (User Manual Name) for LMU1_RGNACCEN9_RA.
* To use register names with standard convension, please use LMU1_RGNACCEN9_RA.
*/
#define LMU1_RGNACCENRA9 (LMU1_RGNACCEN9_RA)

/** \brief 1EC, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN9_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81101ECu)
/** Alias (User Manual Name) for LMU1_RGNACCEN9_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN9_RB.
*/
#define LMU1_RGNACCENRB9 (LMU1_RGNACCEN9_RB)

/** \brief 1F8, LMU Region Read Access Enable Register A */
#define LMU1_RGNACCEN10_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81101F8u)
/** Alias (User Manual Name) for LMU1_RGNACCEN10_RA.
* To use register names with standard convension, please use LMU1_RGNACCEN10_RA.
*/
#define LMU1_RGNACCENRA10 (LMU1_RGNACCEN10_RA)

/** \brief 1FC, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN10_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81101FCu)
/** Alias (User Manual Name) for LMU1_RGNACCEN10_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN10_RB.
*/
#define LMU1_RGNACCENRB10 (LMU1_RGNACCEN10_RB)

/** \brief 208, LMU Region Read Access Enable Register A */
#define LMU1_RGNACCEN11_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8110208u)
/** Alias (User Manual Name) for LMU1_RGNACCEN11_RA.
* To use register names with standard convension, please use LMU1_RGNACCEN11_RA.
*/
#define LMU1_RGNACCENRA11 (LMU1_RGNACCEN11_RA)

/** \brief 20C, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN11_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF811020Cu)
/** Alias (User Manual Name) for LMU1_RGNACCEN11_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN11_RB.
*/
#define LMU1_RGNACCENRB11 (LMU1_RGNACCEN11_RB)

/** \brief 218, LMU Region Read Access Enable Register A */
#define LMU1_RGNACCEN12_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8110218u)
/** Alias (User Manual Name) for LMU1_RGNACCEN12_RA.
* To use register names with standard convension, please use LMU1_RGNACCEN12_RA.
*/
#define LMU1_RGNACCENRA12 (LMU1_RGNACCEN12_RA)

/** \brief 21C, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN12_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF811021Cu)
/** Alias (User Manual Name) for LMU1_RGNACCEN12_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN12_RB.
*/
#define LMU1_RGNACCENRB12 (LMU1_RGNACCEN12_RB)

/** \brief 228, LMU Region Read Access Enable Register A */
#define LMU1_RGNACCEN13_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8110228u)
/** Alias (User Manual Name) for LMU1_RGNACCEN13_RA.
* To use register names with standard convension, please use LMU1_RGNACCEN13_RA.
*/
#define LMU1_RGNACCENRA13 (LMU1_RGNACCEN13_RA)

/** \brief 22C, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN13_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF811022Cu)
/** Alias (User Manual Name) for LMU1_RGNACCEN13_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN13_RB.
*/
#define LMU1_RGNACCENRB13 (LMU1_RGNACCEN13_RB)

/** \brief 238, LMU Region Read Access Enable Register A */
#define LMU1_RGNACCEN14_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8110238u)
/** Alias (User Manual Name) for LMU1_RGNACCEN14_RA.
* To use register names with standard convension, please use LMU1_RGNACCEN14_RA.
*/
#define LMU1_RGNACCENRA14 (LMU1_RGNACCEN14_RA)

/** \brief 23C, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN14_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF811023Cu)
/** Alias (User Manual Name) for LMU1_RGNACCEN14_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN14_RB.
*/
#define LMU1_RGNACCENRB14 (LMU1_RGNACCEN14_RB)

/** \brief 248, LMU Region Read Access Enable Register A */
#define LMU1_RGNACCEN15_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8110248u)
/** Alias (User Manual Name) for LMU1_RGNACCEN15_RA.
* To use register names with standard convension, please use LMU1_RGNACCEN15_RA.
*/
#define LMU1_RGNACCENRA15 (LMU1_RGNACCEN15_RA)

/** \brief 24C, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN15_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF811024Cu)
/** Alias (User Manual Name) for LMU1_RGNACCEN15_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN15_RB.
*/
#define LMU1_RGNACCENRB15 (LMU1_RGNACCEN15_RB)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Lmu_Registers_Cfg_Lmu2
 * \{  */
/** \brief 0, LMU Clock Control Register */
#define LMU2_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_CLC*)0xF8120000u)

/** \brief 8, LMU Module ID Register */
#define LMU2_MODID /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_MODID*)0xF8120008u)

/** \brief 10, LMU Access Enable Register 0 */
#define LMU2_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_ACCEN0*)0xF8120010u)

/** \brief 14, LMU Access Enable Register 1 */
#define LMU2_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_ACCEN1*)0xF8120014u)

/** \brief 20, LMU Memory Control Register */
#define LMU2_MEMCON /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_MEMCON*)0xF8120020u)

/** \brief 24, LMU Safety Control Register */
#define LMU2_SCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_SCTRL*)0xF8120024u)

/** \brief 50, LMU Region Lower Address Register */
#define LMU2_RGN0_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8120050u)
/** Alias (User Manual Name) for LMU2_RGN0_LA.
* To use register names with standard convension, please use LMU2_RGN0_LA.
*/
#define LMU2_RGNLA0 (LMU2_RGN0_LA)

/** \brief 54, LMU Region Upper Address Register */
#define LMU2_RGN0_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8120054u)
/** Alias (User Manual Name) for LMU2_RGN0_UA.
* To use register names with standard convension, please use LMU2_RGN0_UA.
*/
#define LMU2_RGNUA0 (LMU2_RGN0_UA)

/** \brief 58, LMU Region Write Access Enable Register A */
#define LMU2_RGN0_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8120058u)
/** Alias (User Manual Name) for LMU2_RGN0_ACCENA.
* To use register names with standard convension, please use LMU2_RGN0_ACCENA.
*/
#define LMU2_RGNACCENWA0 (LMU2_RGN0_ACCENA)

/** \brief 5C, LMU Region Write Access Enable Register B */
#define LMU2_RGN0_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF812005Cu)
/** Alias (User Manual Name) for LMU2_RGN0_ACCENB.
* To use register names with standard convension, please use LMU2_RGN0_ACCENB.
*/
#define LMU2_RGNACCENWB0 (LMU2_RGN0_ACCENB)

/** \brief 60, LMU Region Lower Address Register */
#define LMU2_RGN1_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8120060u)
/** Alias (User Manual Name) for LMU2_RGN1_LA.
* To use register names with standard convension, please use LMU2_RGN1_LA.
*/
#define LMU2_RGNLA1 (LMU2_RGN1_LA)

/** \brief 64, LMU Region Upper Address Register */
#define LMU2_RGN1_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8120064u)
/** Alias (User Manual Name) for LMU2_RGN1_UA.
* To use register names with standard convension, please use LMU2_RGN1_UA.
*/
#define LMU2_RGNUA1 (LMU2_RGN1_UA)

/** \brief 68, LMU Region Write Access Enable Register A */
#define LMU2_RGN1_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8120068u)
/** Alias (User Manual Name) for LMU2_RGN1_ACCENA.
* To use register names with standard convension, please use LMU2_RGN1_ACCENA.
*/
#define LMU2_RGNACCENWA1 (LMU2_RGN1_ACCENA)

/** \brief 6C, LMU Region Write Access Enable Register B */
#define LMU2_RGN1_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF812006Cu)
/** Alias (User Manual Name) for LMU2_RGN1_ACCENB.
* To use register names with standard convension, please use LMU2_RGN1_ACCENB.
*/
#define LMU2_RGNACCENWB1 (LMU2_RGN1_ACCENB)

