Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxLmu_reg.h
/** \brief 14C, LMU Region Write Access Enable Register B */
#define LMU2_RGN15_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF812014Cu)
/** Alias (User Manual Name) for LMU2_RGN15_ACCENB.
* To use register names with standard convension, please use LMU2_RGN15_ACCENB.
*/
#define LMU2_RGNACCENWB15 (LMU2_RGN15_ACCENB)

/** \brief 158, LMU Region Read Access Enable Register A */
#define LMU2_RGNACCEN0_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8120158u)
/** Alias (User Manual Name) for LMU2_RGNACCEN0_RA.
* To use register names with standard convension, please use LMU2_RGNACCEN0_RA.
*/
#define LMU2_RGNACCENRA0 (LMU2_RGNACCEN0_RA)

/** \brief 15C, LMU Region Read Access Enable Register B */
#define LMU2_RGNACCEN0_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF812015Cu)
/** Alias (User Manual Name) for LMU2_RGNACCEN0_RB.
* To use register names with standard convension, please use LMU2_RGNACCEN0_RB.
*/
#define LMU2_RGNACCENRB0 (LMU2_RGNACCEN0_RB)

/** \brief 168, LMU Region Read Access Enable Register A */
#define LMU2_RGNACCEN1_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8120168u)
/** Alias (User Manual Name) for LMU2_RGNACCEN1_RA.
* To use register names with standard convension, please use LMU2_RGNACCEN1_RA.
*/
#define LMU2_RGNACCENRA1 (LMU2_RGNACCEN1_RA)

/** \brief 16C, LMU Region Read Access Enable Register B */
#define LMU2_RGNACCEN1_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF812016Cu)
/** Alias (User Manual Name) for LMU2_RGNACCEN1_RB.
* To use register names with standard convension, please use LMU2_RGNACCEN1_RB.
*/
#define LMU2_RGNACCENRB1 (LMU2_RGNACCEN1_RB)

/** \brief 178, LMU Region Read Access Enable Register A */
#define LMU2_RGNACCEN2_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8120178u)
/** Alias (User Manual Name) for LMU2_RGNACCEN2_RA.
* To use register names with standard convension, please use LMU2_RGNACCEN2_RA.
*/
#define LMU2_RGNACCENRA2 (LMU2_RGNACCEN2_RA)

/** \brief 17C, LMU Region Read Access Enable Register B */
#define LMU2_RGNACCEN2_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF812017Cu)
/** Alias (User Manual Name) for LMU2_RGNACCEN2_RB.
* To use register names with standard convension, please use LMU2_RGNACCEN2_RB.
*/
#define LMU2_RGNACCENRB2 (LMU2_RGNACCEN2_RB)

/** \brief 188, LMU Region Read Access Enable Register A */
#define LMU2_RGNACCEN3_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8120188u)
/** Alias (User Manual Name) for LMU2_RGNACCEN3_RA.
* To use register names with standard convension, please use LMU2_RGNACCEN3_RA.
*/
#define LMU2_RGNACCENRA3 (LMU2_RGNACCEN3_RA)

/** \brief 18C, LMU Region Read Access Enable Register B */
#define LMU2_RGNACCEN3_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF812018Cu)
/** Alias (User Manual Name) for LMU2_RGNACCEN3_RB.
* To use register names with standard convension, please use LMU2_RGNACCEN3_RB.
*/
#define LMU2_RGNACCENRB3 (LMU2_RGNACCEN3_RB)

/** \brief 198, LMU Region Read Access Enable Register A */
#define LMU2_RGNACCEN4_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8120198u)
/** Alias (User Manual Name) for LMU2_RGNACCEN4_RA.
* To use register names with standard convension, please use LMU2_RGNACCEN4_RA.
*/
#define LMU2_RGNACCENRA4 (LMU2_RGNACCEN4_RA)

/** \brief 19C, LMU Region Read Access Enable Register B */
#define LMU2_RGNACCEN4_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF812019Cu)
/** Alias (User Manual Name) for LMU2_RGNACCEN4_RB.
* To use register names with standard convension, please use LMU2_RGNACCEN4_RB.
*/
#define LMU2_RGNACCENRB4 (LMU2_RGNACCEN4_RB)

/** \brief 1A8, LMU Region Read Access Enable Register A */
#define LMU2_RGNACCEN5_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81201A8u)
/** Alias (User Manual Name) for LMU2_RGNACCEN5_RA.
* To use register names with standard convension, please use LMU2_RGNACCEN5_RA.
*/
#define LMU2_RGNACCENRA5 (LMU2_RGNACCEN5_RA)

/** \brief 1AC, LMU Region Read Access Enable Register B */
#define LMU2_RGNACCEN5_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81201ACu)
/** Alias (User Manual Name) for LMU2_RGNACCEN5_RB.
* To use register names with standard convension, please use LMU2_RGNACCEN5_RB.
*/
#define LMU2_RGNACCENRB5 (LMU2_RGNACCEN5_RB)

/** \brief 1B8, LMU Region Read Access Enable Register A */
#define LMU2_RGNACCEN6_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81201B8u)
/** Alias (User Manual Name) for LMU2_RGNACCEN6_RA.
* To use register names with standard convension, please use LMU2_RGNACCEN6_RA.
*/
#define LMU2_RGNACCENRA6 (LMU2_RGNACCEN6_RA)

/** \brief 1BC, LMU Region Read Access Enable Register B */
#define LMU2_RGNACCEN6_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81201BCu)
/** Alias (User Manual Name) for LMU2_RGNACCEN6_RB.
* To use register names with standard convension, please use LMU2_RGNACCEN6_RB.
*/
#define LMU2_RGNACCENRB6 (LMU2_RGNACCEN6_RB)

/** \brief 1C8, LMU Region Read Access Enable Register A */
#define LMU2_RGNACCEN7_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81201C8u)
/** Alias (User Manual Name) for LMU2_RGNACCEN7_RA.
* To use register names with standard convension, please use LMU2_RGNACCEN7_RA.
*/
#define LMU2_RGNACCENRA7 (LMU2_RGNACCEN7_RA)

/** \brief 1CC, LMU Region Read Access Enable Register B */
#define LMU2_RGNACCEN7_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81201CCu)
/** Alias (User Manual Name) for LMU2_RGNACCEN7_RB.
* To use register names with standard convension, please use LMU2_RGNACCEN7_RB.
*/
#define LMU2_RGNACCENRB7 (LMU2_RGNACCEN7_RB)

/** \brief 1D8, LMU Region Read Access Enable Register A */
#define LMU2_RGNACCEN8_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81201D8u)
/** Alias (User Manual Name) for LMU2_RGNACCEN8_RA.
* To use register names with standard convension, please use LMU2_RGNACCEN8_RA.
*/
#define LMU2_RGNACCENRA8 (LMU2_RGNACCEN8_RA)

