Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxLmu_reg.h
/** \brief 1DC, LMU Region Read Access Enable Register B */
#define LMU2_RGNACCEN8_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81201DCu)
/** Alias (User Manual Name) for LMU2_RGNACCEN8_RB.
* To use register names with standard convension, please use LMU2_RGNACCEN8_RB.
*/
#define LMU2_RGNACCENRB8 (LMU2_RGNACCEN8_RB)

/** \brief 1E8, LMU Region Read Access Enable Register A */
#define LMU2_RGNACCEN9_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81201E8u)
/** Alias (User Manual Name) for LMU2_RGNACCEN9_RA.
* To use register names with standard convension, please use LMU2_RGNACCEN9_RA.
*/
#define LMU2_RGNACCENRA9 (LMU2_RGNACCEN9_RA)

/** \brief 1EC, LMU Region Read Access Enable Register B */
#define LMU2_RGNACCEN9_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81201ECu)
/** Alias (User Manual Name) for LMU2_RGNACCEN9_RB.
* To use register names with standard convension, please use LMU2_RGNACCEN9_RB.
*/
#define LMU2_RGNACCENRB9 (LMU2_RGNACCEN9_RB)

/** \brief 1F8, LMU Region Read Access Enable Register A */
#define LMU2_RGNACCEN10_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81201F8u)
/** Alias (User Manual Name) for LMU2_RGNACCEN10_RA.
* To use register names with standard convension, please use LMU2_RGNACCEN10_RA.
*/
#define LMU2_RGNACCENRA10 (LMU2_RGNACCEN10_RA)

/** \brief 1FC, LMU Region Read Access Enable Register B */
#define LMU2_RGNACCEN10_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81201FCu)
/** Alias (User Manual Name) for LMU2_RGNACCEN10_RB.
* To use register names with standard convension, please use LMU2_RGNACCEN10_RB.
*/
#define LMU2_RGNACCENRB10 (LMU2_RGNACCEN10_RB)

/** \brief 208, LMU Region Read Access Enable Register A */
#define LMU2_RGNACCEN11_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8120208u)
/** Alias (User Manual Name) for LMU2_RGNACCEN11_RA.
* To use register names with standard convension, please use LMU2_RGNACCEN11_RA.
*/
#define LMU2_RGNACCENRA11 (LMU2_RGNACCEN11_RA)

/** \brief 20C, LMU Region Read Access Enable Register B */
#define LMU2_RGNACCEN11_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF812020Cu)
/** Alias (User Manual Name) for LMU2_RGNACCEN11_RB.
* To use register names with standard convension, please use LMU2_RGNACCEN11_RB.
*/
#define LMU2_RGNACCENRB11 (LMU2_RGNACCEN11_RB)

/** \brief 218, LMU Region Read Access Enable Register A */
#define LMU2_RGNACCEN12_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8120218u)
/** Alias (User Manual Name) for LMU2_RGNACCEN12_RA.
* To use register names with standard convension, please use LMU2_RGNACCEN12_RA.
*/
#define LMU2_RGNACCENRA12 (LMU2_RGNACCEN12_RA)

/** \brief 21C, LMU Region Read Access Enable Register B */
#define LMU2_RGNACCEN12_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF812021Cu)
/** Alias (User Manual Name) for LMU2_RGNACCEN12_RB.
* To use register names with standard convension, please use LMU2_RGNACCEN12_RB.
*/
#define LMU2_RGNACCENRB12 (LMU2_RGNACCEN12_RB)

/** \brief 228, LMU Region Read Access Enable Register A */
#define LMU2_RGNACCEN13_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8120228u)
/** Alias (User Manual Name) for LMU2_RGNACCEN13_RA.
* To use register names with standard convension, please use LMU2_RGNACCEN13_RA.
*/
#define LMU2_RGNACCENRA13 (LMU2_RGNACCEN13_RA)

/** \brief 22C, LMU Region Read Access Enable Register B */
#define LMU2_RGNACCEN13_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF812022Cu)
/** Alias (User Manual Name) for LMU2_RGNACCEN13_RB.
* To use register names with standard convension, please use LMU2_RGNACCEN13_RB.
*/
#define LMU2_RGNACCENRB13 (LMU2_RGNACCEN13_RB)

/** \brief 238, LMU Region Read Access Enable Register A */
#define LMU2_RGNACCEN14_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8120238u)
/** Alias (User Manual Name) for LMU2_RGNACCEN14_RA.
* To use register names with standard convension, please use LMU2_RGNACCEN14_RA.
*/
#define LMU2_RGNACCENRA14 (LMU2_RGNACCEN14_RA)

/** \brief 23C, LMU Region Read Access Enable Register B */
#define LMU2_RGNACCEN14_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF812023Cu)
/** Alias (User Manual Name) for LMU2_RGNACCEN14_RB.
* To use register names with standard convension, please use LMU2_RGNACCEN14_RB.
*/
#define LMU2_RGNACCENRB14 (LMU2_RGNACCEN14_RB)

/** \brief 248, LMU Region Read Access Enable Register A */
#define LMU2_RGNACCEN15_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8120248u)
/** Alias (User Manual Name) for LMU2_RGNACCEN15_RA.
* To use register names with standard convension, please use LMU2_RGNACCEN15_RA.
*/
#define LMU2_RGNACCENRA15 (LMU2_RGNACCEN15_RA)

/** \brief 24C, LMU Region Read Access Enable Register B */
#define LMU2_RGNACCEN15_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF812024Cu)
/** Alias (User Manual Name) for LMU2_RGNACCEN15_RB.
* To use register names with standard convension, please use LMU2_RGNACCEN15_RB.
*/
#define LMU2_RGNACCENRB15 (LMU2_RGNACCEN15_RB)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXLMU_REG_H */
